// 発展課題②（早く終わった人向け）
// 配列を末尾から先頭まで出力したいが、このコードは動かない（無限ループ＋配列外参照）。
// なぜダメか説明し、正しく直せ。
// ↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
// 原因：bonus1のものと同じようなことが起きている。ループ条件はiが0以上であること。符号なしの変数は0未満のかずになることはないため、
// ループ条件が満たされずループを抜け出すことができない。そして、iが0の状態でiから1を引くと、符号なし変数の最大値にジャンプするので、
// 処理がうまくいかない。今回の場合、大きな数にジャンプしてしまうと配列の範囲外を読み込むこととなってしまい、エラーが発生してしまう。
// 対処：いくつかあるが、今回はiが0になったときループを強制終了させるようbreakを入れた。他にはiの定義のところを符号ありにするなどがある。

#include <stdio.h>

int main(void)
{
    unsigned int arr[5] = {10, 20, 30, 40, 50};
    for (unsigned int i = 4; i >= 0; i--)
    {
        printf("%d\n", arr[i]);
        if (i == 0)
        {
            break;
        }
    }
}
