// 発展課題②（早く終わった人向け）
// 配列を末尾から先頭まで出力したいが、このコードは動かない（無限ループ＋配列外参照）。
// なぜダメか説明し、正しく直せ。

// 

#include <stdio.h>

int main(void) {
    unsigned int arr[5] = {10, 20, 30, 40, 50};
    for (unsigned int i = 4; i >= 0; i--) {
        printf("%d\n", arr[i]);
        if (i == 0) break;
    }
}

//
// バグの原因 -> デクリメントと条件チェックのタイミングの問題
// i = 0 で配列にアクセスしたあと、変数のデクリメントと条件チェックが走るその時の順序が
// 1. デクリメント
// 2. 条件チェック
// の順番になっているため0で終端処理に入ると
// 0-- -> 255
// 255 >= 0 ? -> True
// となり無限ループが起こる。
// 
// 対策
// - iをunsignedではなくsignedにして使う
// - i == 0になったらプログラムが終了するようにする
//